'''
문제 설명)
일렬로 나열된 n개의 풍선이 있습니다. 모든 풍선에는 서로 다른 숫자가 써져 있습니다.
당신은 다음 과정을 반복하면서 풍선들을 단 1개만 남을 때까지 계속 터트리려고 합니다.

임의의 인접한 두 풍선을 고른 뒤, 두 풍선 중 하나를 터트립니다.
터진 풍선으로 인해 풍선들 사이에 빈 공간이 생겼다면, 빈 공간이 없도록 풍선들을 중앙으로 밀착시킵니다.
여기서 조건이 있습니다. 인접한 두 풍선 중에서 번호가 더 작은 풍선을 터트리는 행위는 최대 1번만 할 수 있습니다.
즉, 어떤 시점에서 인접한 두 풍선 중 번호가 더 작은 풍선을 터트렸다면,
그 이후에는 인접한 두 풍선을 고른 뒤 번호가 더 큰 풍선만을 터트릴 수 있습니다.

당신은 어떤 풍선이 최후까지 남을 수 있는지 알아보고 싶습니다. 위에 서술된 조건대로 풍선을 터트리다 보면,
어떤 풍선은 최후까지 남을 수도 있지만, 어떤 풍선은 무슨 수를 쓰더라도 마지막까지 남기는 것이 불가능할 수도 있습니다.

일렬로 나열된 풍선들의 번호가 담긴 배열 a가 주어집니다.
위에 서술된 규칙대로 풍선들을 1개만 남을 때까지 터트렸을 때 최후까지 남기는 것이 가능한 풍선들의 개수를 return 하도록 solution 함수를 완성해주세요.

제한 사항)
a의 길이는 1 이상 1,000,000 이하입니다.
a[i]는 i+1 번째 풍선에 써진 숫자를 의미합니다.
a의 모든 수는 -1,000,000,000 이상 1,000,000,000 이하인 정수입니다.
a의 모든 수는 서로 다릅니다.

'''
#자기 자신을 기준으로 왼쪽의 min, 오른쪽의 min값 중에 한 개라도 자기보다 큰 값이 있으면 되는거임
def solution(a):
    candi = set()
    left_min = 1000000001
    right_min = 1000000001
    #왼->오
    for i in range(len(a)):
        if left_min > a[i]:
            candi.add(a[i])
            left_min = a[i]

    #오->왼
    for i in range(len(a) - 1, -1, -1):
        if right_min > a[i]:
            candi.add(a[i])
            right_min = a[i]

    return len(candi)


'''
정확성  테스트
테스트 1 〉	통과 (0.01ms, 10.1MB)
테스트 2 〉	통과 (0.01ms, 10.2MB)
테스트 3 〉	통과 (0.16ms, 10.2MB)
테스트 4 〉	통과 (10.38ms, 14.3MB)
테스트 5 〉	통과 (47.40ms, 31.7MB)
테스트 6 〉	통과 (70.41ms, 42.5MB)
테스트 7 〉	통과 (103.10ms, 53.4MB)
테스트 8 〉	통과 (102.59ms, 53.4MB)
테스트 9 〉	통과 (94.86ms, 53.4MB)
테스트 10 〉	통과 (95.94ms, 53.4MB)
테스트 11 〉	통과 (289.38ms, 103MB)
테스트 12 〉	통과 (269.44ms, 103MB)
테스트 13 〉	통과 (182.87ms, 79.1MB)
테스트 14 〉	통과 (263.35ms, 103MB)
테스트 15 〉	통과 (314.73ms, 103MB)
채점 결과
정확성: 100.0
합계: 100.0 / 100.0
'''